# FabricationProductDataFinishDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationProductDataFinishDescription Property
ParameterTypeId Class See Also
---
"Product Finish Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationProductDataFinishDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationProductDataFinishDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationProductDataFinishDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace